{
  "en": {
    "title1": "In 2024, food waste across Asia added up to",
    "title1_unit": "tons.",
    "p1_1": "That is not just a statistic. It shows meals lost, resources drained and communities left behind.",
    "p1_2": "To understand this better, let us explore how food waste looks across Asia. Where do the biggest totals appear and what patterns can we find? The map below begins to reveal the hidden patterns.",
    "p1_3_map_reveal": "The map reveals how food waste is spread across Asia, with some countries showing massive totals while others contribute smaller but still significant amounts.",
    "p1_4_trigger_1": "These differences remind us, food waste is not just about where it happens...",
    "p1_5_trigger_2": "but also about what kinds of food are being lost...",
    "p1_6_scroll_lock_1": "So, let us explore...",
    "p1_7_scroll_lock_2": "Which foods are wasted the most in Asia?",
    "p1_8_treemap_intro": "The treemap below shows the everyday items: vegetables, cereals, fruits and even rice that disappear in huge amounts each year.",
    "p1_9_treemap_outro": "These are not just numbers... They are the foods we rely on every day.",
    "p1_10_scroll_lock_3": "However,",
    "p1_11_scroll_lock_4": "when seen through the global lens, food waste takes on different shapes across sectors.",
    "p1_12_linechart_intro": "Let us have a closer look at the distribution to reveal where the problem truly lies.",
    "p1_13_linechart_outro": "Globally, households are the biggest source of food waste, far more than restaurants or retail. This reminds us, the issue is not only about supply chains, it begins in our own kitchens...",
    "btn_chap2": "Chapter 2",
    "m2_title": "Module 2: Consumer Behaviour",
    "m2_scene1_text": "The kitchen becomes the stage where food waste begins... <br> <b>Module 2: Consumer Behaviour</b>",
    "m2_p1_1": "Across Asia, consumers purchase food as a vital part of daily survival, an essential need for every individual. <br> ",
    "m2_p1_2": "But the largest portion of food waste does not occur in markets or restaurants... <br>",
    "m2_p1_3_focus": "It begins at our home...",
    "m2_p1_4": "Why does this happen? Let us explore the following chart to uncover the reasons and gain deeper insights.",
    "m2_p2_1": "Behind each bar line is about a story of meals prepared, leftovers discarded and opportunities lost... <br> It reminding us that food waste is as much about individual behaviour...",
    "m2_p3_1": "As a Malaysian, have you ever wondered…<br> What drives our consumer behaviour and why food waste keeps happening in daily life?",
    "m2_p4_1": "Let us explore the chart below… It reveals the main causes and shows how Malaysians truly behave...",
    "m2_p5_1": "From the chart we can see that, there are",
    "m2_p5_2_focus": "32.15%",
    "m2_p5_3": "showing that the food waste occurs due to exceed expiration date.",
    "m2_p6_1": "But.... does it really not edible? Or just because of...",
    "m2_p6_2_focus": "misunderstanding...",
    "m2_p7_1": "Surprisingly,",
    "m2_p7_2_focus": "33.77%",
    "m2_p7_3": "of Malaysians say they cannot differentiate between “use by” and “best before.” ",
    "m2_p7_4": "So, what do these labels really mean? Let have a look on this explanation...",
    "m2_scroll1_hint": "Scroll to Continue",
    "m2_scroll1_l1": "Use By",
    "m2_scroll1_l2": "Means",
    "m2_scroll1_l3": "Eat the food before this date.",
    "m2_scroll1_l4": "After that, it may be unsafe.",
    "m2_scroll2_hint": "Scroll to Continue",
    "m2_scroll2_l1": "Best Before",
    "m2_scroll2_l2": "Means",
    "m2_scroll2_l3": "Eat the food before this date for best quality.",
    "m2_scroll2_l4": "",
    "m2_p8_1": "By understanding the meaning of these labels helps to reduce the food waste add up...<br> But do you figure that the hiding reality you have yet notice in your life...",
    "btn_chap3": "Chapter 3",
    "m3_title": "Module 3: Hunger",
    "m3_scene1_text": "Unseen Reality: Food Waste and Hunger... <br> <b>Module 3: Hunger</b>",
    "m3_q_title": "Do you ever wonder...<br> How the waste we discard could nourish those who go hungry?",
    "m3_p1_1": "Food waste isn’t just a statistic <br> It is a missed opportunity to feed millions.",
    "m3_p1_2": "Let begins with the six countries in Asia.<br> See how much food waste they generate<br> and how many meals that could become.",
    "m3_label_country": "Country:",
    "m3_label_year": "Year:",
    "m3_icon_legend_note": "1 Icon = ~ 1 Million Meals",
    "m3_icon_label_total": "Total Waste:",
    "m3_icon_label_meals": "Meals Available:",
    "m3_icon_data_note": "Select a country and year to view data.",
    "m3_icon_legend_title": "Chart Legend & Full Scale Explanation:",
    "m3_icon_legend_filled": "Filled Icon (Meals generated from food waste)",
    "m3_icon_legend_unfilled": "Unfilled Icon (Total capacity not met)",
    "m3_icon_legend_scale_p": "Scale Explanation:",
    "m3_icon_legend_scale_li1": "The number of meals is calculated by converting the country's annual food waste into meal equivalents.",
    "m3_icon_legend_scale_li2": "The chart has a maximum display capacity of 20 icons, representing 20 million potential meals.",
    "m3_icon_legend_scale_li3": "The icons visually show the total number of million meals available for the selected year.",
    "m3_p2_1": "The chart is only an assumption of how waste could feed people Its purpose is to remind us to care for every piece of food in our hands...",
    "m3_p3_1": "Every wasted food no matter it is a small or big portion is still wasted... <br> Behind those lost meals are ",
    "m3_p3_2_focus": "children who cannot grow well and whose futures are held back...",
    "m3_p3_3": "So, let us dive into the next chart which shows stunting levels across five Asia country,<br> focusing on selected five countries.",
    "m3_map_title": "Stunting Severity by Country",
    "m3_map_label_year": "Select Year:",
    "m3_map_legend_title": "Severity Legend:",
    "m3_map_legend_vh": "Very High (>= 40%)",
    "m3_map_legend_h": "High (30% - 39.9%)",
    "m3_map_legend_m": "Medium (20% - 29.9%)",
    "m3_map_legend_l": "Low (< 20%)",
    "m3_map_legend_ns": "Not Selected Country",
    "m3_p4_1": "Do you understand what stunting mean?",
    "m3_p4_2_focus": "It means children cannot grow to their full height and potential…<br>because of long‑term poor nutrition.",
    "m3_p4_3": "The effect is",
    "m3_p4_4_focus": "serious",
    "m3_p4_5": ", children may face weak health, poor learning, and limited futures.",
    "m3_p4_6": "But stunting is only one part of the story…",
    "m3_p5_1": "People who are stunted often face <span style='color: red; font-size: 1.5em; display: block;'>undernourishment…</span> but undernourishment is not only about wasted food… It is also about poverty, inequality, conflict and climate change…",
    "m3_p5_2": "All of these limit access to enough healthy food. <span style='color: rgb(255, 255, 201); display: block;'>Wasted food makes the problem worse…</span> Because while some food is thrown away, many people still go hungry.",
    "m3_p5_3": "This reminds us that hunger is not just about the amount of food produced. <span style='color: rgb(255, 255, 201); display: block;'>It is about whether food reaches every single individual…</span>",
    "m3_p5_4": "The next chart shows the number of undernourished people by region from 2005 to 2023, helping us see how this challenge has changed over time.",
    "m3_timeline_title": "Number of Undernourished (Millions) by Region (2005-2023)",
    "m3_timeline_filter": "Filter Regions:",
    "m3_p6_1": "The chart shows that undernourishment has not disappeared… <br> In some regions the numbers have gone down but in others they remain high. This reminds us that progress is uneven… <br> and millions of lives are still affected.",
    "btn_quiz": "Start Final Quiz →",
    "d3_tt_undernourished": "Undernourished:",
    "d3_tt_stunting_rate": "Rate:",
    "d3_tt_stunting_severity": "Severity:",
    "d3_tt_not_selected": "Not Selected Country"
  },
  "bm": {
    "title1": "Pada tahun 2024, sisa makanan di seluruh Asia berjumlah",
    "title1_unit": "tan.",
    "p1_1": "Ini bukan sekadar statistik. Ia menunjukkan makanan yang hilang, sumber yang terkuras dan komuniti yang tertinggal.",
    "p1_2": "Untuk memahaminya dengan lebih baik, mari kita terokai bagaimana sisa makanan kelihatan di seluruh Asia. Di manakah jumlah terbesar muncul dan corak apakah yang boleh kita temui? Peta di bawah mula mendedahkan corak tersembunyi.",
    "p1_3_map_reveal": "Peta ini mendedahkan bagaimana sisa makanan tersebar di seluruh Asia, dengan beberapa negara menunjukkan jumlah besar manakala yang lain menyumbang jumlah yang lebih kecil tetapi masih signifikan.",
    "p1_4_trigger_1": "Perbezaan ini mengingatkan kita, sisa makanan bukan sahaja tentang di mana ia berlaku...",
    "p1_5_trigger_2": "tetapi juga tentang jenis makanan yang hilang...",
    "p1_6_scroll_lock_1": "Jadi, mari kita terokai...",
    "p1_7_scroll_lock_2": "Makanan manakah yang paling banyak dibazirkan di Asia?",
    "p1_8_treemap_intro": "Peta pokok di bawah menunjukkan barangan harian: sayur-sayuran, bijirin, buah-buahan dan juga nasi yang hilang dalam jumlah yang besar setiap tahun.",
    "p1_9_treemap_outro": "Ini bukan sekadar nombor... Mereka adalah makanan yang kita bergantung padanya setiap hari.",
    "p1_10_scroll_lock_3": "Walau bagaimanapun,",
    "p1_11_scroll_lock_4": "apabila dilihat melalui lensa global, sisa makanan mengambil bentuk yang berbeza merentasi sektor.",
    "p1_12_linechart_intro": "Mari kita lihat dengan lebih dekat pengagihan untuk mendedahkan di mana masalah itu sebenarnya terletak.",
    "p1_13_linechart_outro": "Secara global, isi rumah adalah sumber terbesar sisa makanan, jauh lebih banyak daripada restoran atau runcit. Ini mengingatkan kita, isu ini bukan hanya mengenai rantaian bekalan, ia bermula di dapur kita sendiri...",
    "btn_chap2": "Bab 2",
    "m2_title": "Modul 2: Tingkah Laku Pengguna",
    "m2_scene1_text": "Dapur menjadi pentas di mana sisa makanan bermula... <br> <b>Modul 2: Tingkah Laku Pengguna</b>",
    "m2_p1_1": "Di seluruh Asia, pengguna membeli makanan sebagai sebahagian penting dalam kelangsungan hidup harian, keperluan penting bagi setiap individu. <br> ",
    "m2_p1_2": "Tetapi sebahagian besar sisa makanan tidak berlaku di pasar atau restoran... <br>",
    "m2_p1_3_focus": "Ia bermula di rumah kita...",
    "m2_p1_4": "Mengapa ini berlaku? Mari kita terokai carta berikut untuk membongkar sebab-sebab dan mendapatkan pandangan yang lebih mendalam.",
    "m2_p2_1": "Di sebalik setiap garisan bar adalah cerita tentang makanan yang disediakan, sisa yang dibuang, dan peluang yang hilang... <br> Ia mengingatkan kita bahawa sisa makanan adalah mengenai tingkah laku individu...",
    "m2_p3_1": "Sebagai rakyat Malaysia, pernahkah anda tertanya-tanya…<br> Apakah yang mendorong tingkah laku pengguna kita dan mengapa sisa makanan terus berlaku dalam kehidupan seharian?",
    "m2_p4_1": "Mari kita terokai carta di bawah… Ia mendedahkan punca utama dan menunjukkan bagaimana rakyat Malaysia benar-benar berkelakuan...",
    "m2_p5_1": "Daripada carta kita dapat melihat bahawa, terdapat",
    "m2_p5_2_focus": "32.15%",
    "m2_p5_3": "menunjukkan bahawa sisa makanan berlaku disebabkan oleh tarikh luput yang melebihi.",
    "m2_p6_1": "Tetapi.... adakah ia benar-benar tidak boleh dimakan? Atau hanya kerana...",
    "m2_p6_2_focus": "salah faham...",
    "m2_p7_1": "Secara mengejutkan,",
    "m2_p7_2_focus": "33.77%",
    "m2_p7_3": "rakyat Malaysia mengatakan mereka tidak dapat membezakan antara “gunakan sebelum” dan “terbaik sebelum.” ",
    "m2_p7_4": "Jadi, apakah maksud label ini sebenarnya? Mari kita lihat penjelasan ini...",
    "m2_scroll1_hint": "Tatal untuk Teruskan",
    "m2_scroll1_l1": "Guna Sebelum",
    "m2_scroll1_l2": "Bermaksud",
    "m2_scroll1_l3": "Makan makanan sebelum tarikh ini. ",
    "m2_scroll1_l4": "Selepas itu, ia mungkin tidak selamat.",
    "m2_scroll2_hint": "Tatal untuk Teruskan",
    "m2_scroll2_l1": "Terbaik Sebelum",
    "m2_scroll2_l2": "Bermaksud",
    "m2_scroll2_l3": "Makan makanan sebelum tarikh ini untuk kualiti terbaik.",
    "m2_scroll2_l4": "",
    "m2_p8_1": "Dengan memahami maksud label ini membantu mengurangkan penambahan sisa makanan...<br> Tetapi adakah anda tahu realiti tersembunyi yang belum anda sedari dalam hidup anda...",
    "btn_chap3": "Bab 3",
    "m3_title": "Modul 3: Kelaparan",
    "m3_scene1_text": "Realiti Tidak Terlihat: Sisa Makanan dan Kelaparan... <br> <b>Modul 3: Kelaparan</b>",
    "m3_q_title": "Pernahkah anda terfikir...<br> Bagaimana sisa yang kita buang boleh memberi makanan kepada mereka yang kelaparan?",
    "m3_p1_1": "Sisa makanan bukan sekadar statistik <br> Ia adalah peluang terlepas untuk memberi makanan kepada berjuta-juta orang.",
    "m3_p1_2": "Mari kita mulakan dengan enam negara di Asia.<br> Lihat berapa banyak sisa makanan yang mereka hasilkan<br> dan berapa banyak makanan yang boleh dihasilkan.",
    "m3_label_country": "Negara:",
    "m3_label_year": "Tahun:",
    "m3_icon_legend_note": "1 Ikon = ~ 1 Juta Hidangan",
    "m3_icon_label_total": "Jumlah Sisa:",
    "m3_icon_label_meals": "Hidangan Tersedia:",
    "m3_icon_data_note": "Pilih negara dan tahun untuk melihat data.",
    "m3_icon_legend_title": "Legenda Carta & Penjelasan Skala Penuh:",
    "m3_icon_legend_filled": "Ikon Berisi (Hidangan yang dihasilkan daripada sisa makanan)",
    "m3_icon_legend_unfilled": "Ikon Kosong (Kapasiti penuh tidak dipenuhi)",
    "m3_icon_legend_scale_p": "Penjelasan Skala:",
    "m3_icon_legend_scale_li1": "Bilangan hidangan dikira dengan menukarkan sisa makanan tahunan negara kepada bersamaan hidangan.",
    "m3_icon_legend_scale_li2": "Carta ini mempunyai kapasiti paparan maksimum 20 ikon, mewakili 20 juta hidangan berpotensi.",
    "m3_icon_legend_scale_li3": "Ikon secara visual menunjukkan jumlah juta hidangan yang tersedia untuk tahun yang dipilih.",
    "m3_p2_1": "Carta ini hanyalah andaian tentang bagaimana sisa boleh memberi makanan kepada orang ramai<br> Tujuannya adalah untuk mengingatkan kita agar mengambil berat setiap keping makanan di tangan kita...",
    "m3_p3_1": "Setiap makanan yang dibazirkan tidak kira ia bahagian kecil atau besar tetap dibazirkan... <br> Di sebalik hidangan yang hilang itu terdapat ",
    "m3_p3_2_focus": "kanak-kanak yang tidak dapat membesar dengan baik dan masa depan mereka terbantut...",
    "m3_p3_3": "Jadi, mari kita selami carta seterusnya yang menunjukkan tahap bantut di lima negara Asia,<br> memfokuskan kepada lima negara terpilih.",
    "m3_map_title": "Keterukan Bantut mengikut Negara",
    "m3_map_label_year": "Pilih Tahun:",
    "m3_map_legend_title": "Legenda Keterukan:",
    "m3_map_legend_vh": "Sangat Tinggi (>= 40%)",
    "m3_map_legend_h": "Tinggi (30% - 39.9%)",
    "m3_map_legend_m": "Sederhana (20% - 29.9%)",
    "m3_map_legend_l": "Rendah (< 20%)",
    "m3_map_legend_ns": "Negara Tidak Dipilih",
    "m3_p4_1": "Adakah anda faham apa maksud bantut?",
    "m3_p4_2_focus": "Ini bermakna kanak-kanak tidak dapat membesar dengan ketinggian dan potensi penuh mereka…<br>kerana kekurangan nutrisi jangka panjang.",
    "m3_p4_3": "Kesan itu adalah",
    "m3_p4_4_focus": "serius",
    "m3_p4_5": ", kanak-kanak mungkin menghadapi kesihatan yang lemah, pembelajaran yang buruk, dan masa depan yang terhad.",
    "m3_p4_6": "But bantut hanyalah sebahagian daripada cerita…",
    "m3_p5_1": "Orang yang bantut sering menghadapi <span style='color: red; font-size: 1.5em; display: block;'>kurang zat makanan…</span> tetapi kurang zat makanan bukan sahaja tentang makanan yang dibazirkan… Ia juga mengenai kemiskinan, ketidaksamaan, konflik dan perubahan iklim…",
    "m3_p5_2": "Semua ini mengehadkan akses kepada makanan sihat yang mencukupi. <span style='color: rgb(255, 255, 201); display: block;'>Sisa makanan memburukkan lagi masalah…</span> Kerana semasa sebahagian makanan dibuang, ramai orang masih kelaparan.",
    "m3_p5_3": "Ini mengingatkan kita bahawa kelaparan bukan hanya tentang jumlah makanan yang dihasilkan. <span style='color: rgb(255, 255, 201); display: block;'>Ia adalah tentang sama ada makanan mencapai setiap individu…</span>",
    "m3_p5_4": "Carta seterusnya menunjukkan bilangan orang yang kurang zat makanan mengikut wilayah dari 2005 hingga 2023, membantu kita melihat bagaimana cabaran ini telah berubah dari semasa ke semasa.",
    "m3_timeline_title": "Bilangan Kurang Zat Makanan (Juta) mengikut Wilayah (2005-2023)",
    "m3_timeline_filter": "Tapis Wilayah:",
    "m3_p6_1": "Carta menunjukkan bahawa kurang zat makanan belum hilang… <br> Di sesetengah wilayah bilangannya telah menurun tetapi di tempat lain ia kekal tinggi. Ini mengingatkan kita bahawa kemajuan adalah tidak sekata… <br> dan berjuta-juta nyawa masih terjejas.",
    "btn_quiz": "Mula Kuiz Akhir →",
    "d3_tt_undernourished": "Kurang Zat Makanan:",
    "d3_tt_stunting_rate": "Kadar:",
    "d3_tt_stunting_severity": "Keterukan:",
    "d3_tt_not_selected": "Negara Tidak Dipilih"
  }
}